# Homebrew formulae
# Requirements:
#    - Homebrew: ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
#    - Command Line Tools for Xcodecode: `xcode-select --install`
#    - Brew Bundle: `brew tap Homebrew/bundle`
# Usage: `brew bundle`.
# Diff this file: $ brew bundle dump && grep -Fvxf dotfiles/Brewfile Brewfile > diff
# Update casks: brew cask install --force $(brew cask list)
# More brews: http://braumeister.org

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/science'
tap 'homebrew/x11'
tap 'neovim/neovim'
tap 'homebrew/python'
tap 'homebrew/tex'


cask 'osxfuse'


# xquartz
cask 'xquartz'


# GNU Core Utilities. Adicionar `$(brew --prefix coreutils)/libexec/gnubin` ao `$PATH`.
brew 'coreutils'
brew 'binutils'
brew 'findutils', args: ['with-default-names']
brew 'moreutils'
brew 'gawk'
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnutls'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'homebrew/dupes/gzip'
brew 'glib'

brew 'homebrew/dupes/rsync'
brew 'homebrew/fuse/ntfs-3g'


# Fonts
brew 'freetype'
brew 'fontconfig'
cask 'font-inconsolata'
cask 'font-terminus'


# Programming

## C
#brew 'gcc'
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'ctags'


# Objective-C
brew 'cocoapods'


## Python Virtual Environments
brew 'pyenv'               


## Java
cask 'java'


# VCS
brew 'git'
brew 'git-extras'
brew 'git-cal'
brew 'git-flow'
brew 'mercurial'
cask 'sourcetree-beta'


brew 'ack'

brew 'readline'

# Select default apps for documents and URL schemes on OS X
brew 'duti'

brew 'htop-osx'

brew 'libtiff'
brew 'webp'
brew 'libyaml'
brew 'rename'
brew 'renameutils'
brew 'tree'
brew 'watch'
brew 'wdiff', args: ['with-gettext']
brew 'wget', args: ['with-iri']
brew 'byobu'


# Shell
brew 'bash'
brew 'zsh'
brew 'zsh-completions'


# Ruby
brew 'ruby'


# Archive
#brew 'unrar'
brew 'homebrew/binary/rar'
brew 'p7zip'
cask 'the-unarchiver'
brew 'homebrew/dupes/unzip'

cask 'android-file-transfer'

# Browser
cask 'firefox'
cask 'google-chrome'

cask 'iterm2'

cask 'flux'

# Screen Capture
cask 'licecap'


# Multimedia
brew 'libpng'
brew 'imagemagick', args: ['with-webp']
brew 'ffmpeg'
cask 'spotify'
cask 'vlc'
brew 'jpeg'


# VPN
brew 'openconnect'


# Cloud Storage
cask 'google-drive'


# IDE
cask 'appcode'


# SQL
brew 'sqlmap'


## Mysql
brew 'mysql'


## SQLite
brew 'sqlite', args: ['with-functions']
cask 'sqlitebrowser'


## MongoDB
cask 'mongodb'


# Message
cask 'skype'
cask 'telegram'


# DjVu viewer
cask 'djview'


# Cryptography
brew 'ssh-copy-id'
brew 'openssl'
brew 'gpg'
cask 'gpgtools'
brew 'gpg-agent'


# Swap ESC and CapsLock
karabiner-elements


# Editor
brew 'neovim/neovim/neovim', args: ['HEAD']
cask 'vimr'
